In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\kanti\anaconda3\lib\site-packages (1.4.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\kanti\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\kanti\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.18.5 in c:\users\kanti\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in c:\users\kanti\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [6]:
df = pd.read_csv('C:\\Users\\kanti\\OneDrive\\Desktop\\emp.csv')

In [7]:
df

    id    name address
0  101     jon    pune
1  102  justin  mumbai
2  103  ramesh    bang

In [8]:
df1 = pd.read_excel('test.xlsx')

In [9]:
df1

   Unnamed: 0       date      city  temp  humidity
0           0  2021/1/24  new york    34        35
1           1  2021/2/25    mumbai    67        67
2           2  2021/3/26      pune    23        97

In [12]:
df2 = pd.read_excel('test.xlsx')

##

In [13]:
df2

   Unnamed: 0       date      city  temp  humidity
0           0  2021/1/24  new york    34        35
1           1  2021/2/25    mumbai    67        67
2           2  2021/3/26      pune    23        97

In [ ]:
csv

by using -- csv module
by using -- pandas

In [14]:
# By using Dict

In [18]:
emp_data = {
    'id':[101,300,40,70,30,60],
    'name':['a','b','c','b','g','u'],
    'city':['pune','mumbai','chennai','pune','pune','pune']
}

In [19]:
emp_data

{'id': [101, 300, 40, 70, 30, 60],
 'name': ['a', 'b', 'c', 'b', 'g', 'u'],
 'city': ['pune', 'mumbai', 'chennai', 'pune', 'pune', 'pune']}

In [20]:
df5 = pd.DataFrame(emp_data)

In [21]:
df5

    id name     city
0  101    a     pune
1  300    b   mumbai
2   40    c  chennai
3   70    b     pune
4   30    g     pune
5   60    u     pune

In [ ]:
df = pd.read_csv('C:\\Users\\kanti\\OneDrive\\Desktop\\emp.csv')
df2 = pd.read_excel('test.xlsx')
df5 = pd.DataFrame(emp_data)

In [23]:
#tuple list

In [24]:
my_list = [
    ('1/1/2021','Senior Software Engineer','Arun'),
    ('3/6/2021','DS','Rahul'),
    ('4/6/2022','ML','Jon')
]

In [25]:
my_list

[('1/1/2021', 'Senior Software Engineer', 'Arun'),
 ('3/6/2021', 'DS', 'Rahul'),
 ('4/6/2022', 'ML', 'Jon')]

In [28]:
df6 = pd.DataFrame(my_list,columns=['Joining Date','Designation','Name'])

In [29]:
df6

  Joining Date               Designation   Name
0     1/1/2021  Senior Software Engineer   Arun
1     3/6/2021                        DS  Rahul
2     4/6/2022                        ML    Jon

In [30]:
df6.to_csv('my_listcsv.csv')

In [31]:
df6.to_excel('1.xlsx')

In [32]:
df6.to_dict()

{'Joining Date': {0: '1/1/2021', 1: '3/6/2021', 2: '4/6/2022'},
 'Designation': {0: 'Senior Software Engineer', 1: 'DS', 2: 'ML'},
 'Name': {0: 'Arun', 1: 'Rahul', 2: 'Jon'}}

In [ ]:
csv---> dump -- django

file read by using pandas ---> to_dict--dump database

In [33]:
#from list of dict

In [34]:
p = [{0: '1/1/2021', 1: '3/6/2021', 2: '4/6/2022'},{0: 'Senior Software Engineer', 1: 'DS', 2: 'ML'}]

In [35]:
df7 = pd.DataFrame()

In [36]:
df7

                          0         1         2
0                  1/1/2021  3/6/2021  4/6/2022
1  Senior Software Engineer        DS        ML

In [37]:
p = [{'name':'arun','role':'it','sal':45000},
     {'name':'jon','role':'DS','sal':55000},
     {'name':'jacky','role':'ML','sal':55000}
    ]

In [38]:
df8 = pd.DataFrame(p)

In [39]:
df8

    name role    sal
0   arun   it  45000
1    jon   DS  55000
2  jacky   ML  55000

In [41]:
df10 = pd.read_html('https://en.wikipedia.org/wiki/COVID-19_pandemic_in_India')

In [49]:
type(df10)

list

In [52]:
df10[7].shape

(11, 6)

In [54]:
df12 = pd.read_json('https://api.sampleapis.com/baseball/hitsSingleSeason')

In [55]:
df12

    Rank         Player  AgeThatYear  Hits  Year Bats   id
0      1  Ichiro Suzuki           30   262  2004    L    1
1      2  George Sisler           27   257  1920    L    2
2      3   Lefty O'Doul           32   254  1929    L    3
3            Bill Terry           31   254  1930    L    4
4      5     Al Simmons           23   253  1925    R    5
..   ...            ...          ...   ...   ...  ...  ...
529          Paul Waner           26   200  1929    L  530
530        Billy Werber           26   200  1934    R  531
531          Bill White           29   200  1963    L  532
532       Pinky Whitney           24   200  1929    R  533
533         Ross Youngs           26   200  1923    L  534

[534 rows x 7 columns]

In [56]:
df12.to_csv('apidata.csv')